---
kind: type
id: T:Autodesk.Revit.DB.Architecture.StairsRun
source: html/ea0e49a0-a007-79d0-c902-a24b1359ae28.htm
---
# Autodesk.Revit.DB.Architecture.StairsRun

Represents a stairs run element in Autodesk Revit.

## Syntax (C#)
```csharp
public class StairsRun : Element
```